app/controllers/blog_controller.rb

SELECT "posts".* FROM "posts" WHERE (publish_date <= '2024-04-17 21:24:28.644227') ORDER BY publish_date desc LIMIT $1  [["LIMIT", 1]]
---
  def index
    @post = Post.where('publish_date <= ?', Time.zone.now).first